## EDA on MovieLens Dataset

### Nikhil Gavin Crasta
#### AIS-2020

In this notebook we will perform EDA on the movielens dataset.

We will perform the following operations:
- Identify missing values and handle them.
- Identify the duplicates and handle them.

In [96]:
from pathlib import Path
import pandas as pd

In [97]:
DATA_DIR = Path('../movielens/ml-latest')

In [98]:
RATINGS_FILEPATH = DATA_DIR / 'ratings.csv'
MOVIES_FILEPATH = DATA_DIR / 'movies.csv'

## Ratings

In [99]:
ratings_raw = pd.read_csv(RATINGS_FILEPATH)
ratings_raw.sample(5)

          userId  movieId  rating   timestamp
21425467  218875     1500     4.5  1111752822
16363853  167362    34162     4.0  1157658075
13064425  133573      364     4.0   846346196
21850095  223206     1748     4.0  1001714829
481417      4871   112852     4.0  1420398128

We will create a variable 'ratings' to store the original values and perform operations on them.

We shall also use the info() function to get the information about the datatypes we'll be dealing with in the dataframe. This will make it easy for us to perform opertaion on the data accordingly.

In [100]:
ratings = ratings_raw.copy()
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27753444 entries, 0 to 27753443
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 847.0 MB

Now, by using the describe() function we'll get the basic statstical values of different columns in the dataset

In [101]:
ratings.describe()

             userId       movieId        rating     timestamp
count  2.775344e+07  2.775344e+07  2.775344e+07  2.775344e+07
mean   1.419420e+05  1.848800e+04  3.530445e+00  1.193122e+09
std    8.170740e+04  3.510263e+04  1.066353e+00  2.160482e+08
min    1.000000e+00  1.000000e+00  5.000000e-01  7.896520e+08
25%    7.117600e+04  1.097000e+03  3.000000e+00  9.986053e+08
50%    1.420220e+05  2.716000e+03  3.500000e+00  1.174256e+09
75%    2.124590e+05  7.150000e+03  4.000000e+00  1.422744e+09
max    2.832280e+05  1.938860e+05  5.000000e+00  1.537945e+09

Let us now see if the dataset contains any null/nan values. If any null/nan values are found we must take care of it by removing the entire row or by replacing it with a suitable value.

In [102]:
ratings.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

Now check for any duplicate values in the ratings dataset using the duplicated() function, and count the total number of duplicate values using the sum() function. 

Identifying duplicates is an important part of EDA as having too much of similar data will not help the model and computation cost also increases.

In [103]:
ratings.duplicated(keep=False).sum()

0

Let us now see the number of unique movieId's present in the dataset. The shape function returns the (row,column) value. By this we can determine the number of unique id's present by seeing the no of rows

In [104]:
ratings['movieId'].unique().shape

(53889,)

Let us check the different values we can get for the movieId: 1091

In [105]:
ratings[(ratings['movieId']==1091)]

          userId  movieId  rating   timestamp
2              1     1091     1.5  1256677471
210            4     1091     1.0  1127946740
12101        133     1091     1.0  1196541969
12240        134     1091     5.0  1357010028
15253        160     1091     3.0  1077935119
...          ...      ...     ...         ...
27738212  283045     1091     2.0  1139014578
27740956  283093     1091     2.0  1235610973
27742046  283099     1091     3.5  1192949336
27750298  283195     1091     4.0  1021944932
27753144  283224     1091     2.0   851000060

[6138 rows x 4 columns]

We can check the count for each rating by using the value_counts() function.

In [106]:
ratings['rating'].value_counts()

4.0    7394710
3.0    5515668
5.0    4071135
3.5    3404360
4.5    2373550
2.0    1850627
2.5    1373419
1.0     886233
0.5     442388
1.5     441354
Name: rating, dtype: int64

## MOVIES

### Let us now perform similar operations on the movies.csv file.

In [107]:
movies_raw = pd.read_csv(MOVIES_FILEPATH)
movies_raw.sample(5)

,movieId,title,genres
41430,156555,Sundays (2015),Sci-Fi
22232,106022,Toy Story of Terror (2013),Animation|Children|Comedy
11304,47868,Ronja Robbersdaughter (Ronja Rövardotter) (1984),Adventure|Children|Drama
34347,139811,Dog Eat Dog (2009),Action|Drama|Romance|Thriller
39440,151969,Style (2001),Thriller

- We'll first make a copy of the original dataframe. Let us store the dataframe in the movies varible,
- Let us use the info() funtion to understand the diffrent data types we'll be dealing with during the analysis. This will make it easy for us to perform related operations.

In [108]:
movies = movies_raw.copy()
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58098 entries, 0 to 58097
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  58098 non-null  int64
 1   title    58098 non-null  object
 2   genres   58098 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.3+ MB

- Now let us check if there is any null values present in the dataframe.
- If we find any null values, we must drop that particular row to get better insights and analysis. 
- We can use the isnull() function to identify the null columns and sum() funtion to get the total.

In [109]:
movies.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

The next step is to check if there is any duplicate values present in the dataset. As multiple similar values will fail to give us a good insights of the data we're dealing with and computationally cost the model.
- We use the duplicated() function to check for duplicate values and pass keep=False as the argument. This will show the duplicate values present in the dataframe.
- And then use the sum() function to calculate the total number of duplicate values present.

In [110]:
movies.duplicated(keep=False).sum()

0

- Let us now find the unique 'genres' present in the dataset using the unique() function. 
- shape function returns number of rows present, by which we can determine the total no of different genres present in the dataset.

In [111]:
movies['genres'].unique().shape

(1643,)

- Now we find the duplicate values w.r.t to 'title' and 'genres' only.

In [112]:
movies.duplicated(['title','genres']).sum()

14

Now that we have found 14 duplicates present in the data, we shall now see how we can handle these duplicate data.

- Create a new variable dup_movies to store the values of duplicate movies w.r.t 'genres' and 'title'.
- Then, find the unique titles present in the duplicate vairables.

In [113]:
dup_movies = movies[movies.duplicated(['title','genres'])]
dup_movies.title.unique()

array(['Offside (2006)', 'Girl, The (2012)', 'Beneath (2013)',
       'Clear History (2013)', 'Johnny Express (2014)', 'Darling (2007)',
       'Home (2008)', 'Macbeth (2015)', 'Seven Years Bad Luck (1921)',
       'Little Man (2006)', 'Dracula (1931)', 'Lucky (2017)',
       'Detour (2017)', 'Berlin Calling (2008)'], dtype=object)

In this step we visualize the duplicate values which we identified in the previous step.

In [114]:
for m in dup_movies.title.unique():
    display(movies[movies.title==m])

       movieId           title        genres
11412    48682  Offside (2006)  Comedy|Drama
15902    80330  Offside (2006)  Comedy|Drama

       movieId             title genres
19914    97773  Girl, The (2012)  Drama
20835   101212  Girl, The (2012)  Drama

       movieId           title  genres
21655   104035  Beneath (2013)  Horror
25046   115777  Beneath (2013)  Horror

       movieId                 title  genres
21691   104155  Clear History (2013)  Comedy
27572   122940  Clear History (2013)  Comedy

       movieId                  title                   genres
23834   111519  Johnny Express (2014)  Animation|Comedy|Sci-Fi
29852   128991  Johnny Express (2014)  Animation|Comedy|Sci-Fi

       movieId           title genres
18867    93279  Darling (2007)  Drama
30226   130062  Darling (2007)  Drama

       movieId        title genres
15637    79254  Home (2008)  Drama
36172   143978  Home (2008)  Drama

       movieId           title genres
33001   136564  Macbeth (2015)  Drama
38804   150310  Macbeth (2015)  Drama

       movieId                        title  genres
14038    70155  Seven Years Bad Luck (1921)  Comedy
44387   163246  Seven Years Bad Luck (1921)  Comedy

       movieId              title  genres
11173    46865  Little Man (2006)  Comedy
48620   172427  Little Man (2006)  Comedy

       movieId           title  genres
2560      2644  Dracula (1931)  Horror
52192   180205  Dracula (1931)  Horror

       movieId         title genres
51339   178401  Lucky (2017)  Drama
52644   181329  Lucky (2017)  Drama

       movieId          title    genres
46904   168774  Detour (2017)  Thriller
52795   181655  Detour (2017)  Thriller

       movieId                  title        genres
13504    66511  Berlin Calling (2008)  Comedy|Drama
57269   191775  Berlin Calling (2008)  Comedy|Drama

Now that we have identified the duplicate values in the movies dataframe. We shall write two functions to handle the duplicate values both in the movies dataframe and the rating dataframe.

- The replace_movie_id_in_rating_dataframe function is called to replace the movieId in ratings dataframe as it'll be changed in the movie dataframe as well.

In [115]:
def replace_movie_id_in_rating_dataframe(dataframe: pd.DataFrame, new_movie_id: int, old_movie_id: int) \
    -> pd.DataFrame:
    dataframe.loc[dataframe.movieId == old_movie_id, 'movieId'] = new_movie_id
    return dataframe

In [116]:
(ratings.movieId==172427).sum()

4

- The remove_old_movie_ids_from_movies_dataframe is called to remove duplicate values from the movies dataframe.

In [117]:
def remove_old_movie_ids_from_movies_dataframe(dataframe: pd.DataFrame, old_movie_ids: [int]) -> pd.DataFrame:
    target_index = dataframe[dataframe.movieId.isin(old_movie_ids)].index
    dataframe = dataframe.drop(target_index)
    return dataframe

Let us build a main function f which handles both the functions:
- replace_movie_id_in_rating_dataframe 
- remove_old_movie_ids_from_movies_dataframe. 

So that we only have to pass in the dataframes into the function and it takes care of all the realted operations.

In [118]:
def f(movies_dataframe: pd.DataFrame, ratings_dataframe: pd.DataFrame) -> (pd.DataFrame, pd.DataFrame):
    duplicates = movies_dataframe[movies_dataframe.duplicated(subset=['title', 'genres'], keep=False)]
    old_movie_ids = []
    for movie_title in duplicates.title.unique():
        movie_ids = duplicates[duplicates.title == movie_title].movieId.values
        new_movie_id, old_movie_id = movie_ids
        ratings_dataframe = replace_movie_id_in_rating_dataframe(ratings_dataframe, new_movie_id, old_movie_id)
        old_movie_ids.append(old_movie_id)
    movies_dataframe = remove_old_movie_ids_from_movies_dataframe(movies_dataframe, old_movie_ids)
    return movies_dataframe, ratings_dataframe

movies2 , ratings2 = f(movies,ratings)

Let us confirm whether the operations have been successfully executed by calculating the difference between the movies_raw dataframe and
the movies2 dataframe. The value of this should be equal to 14, as we've taken out 14 duplicates from the dataframe.

In [119]:
len(movies_raw)-len(movies2)

14

Yes, the operations have been performed. As the expected value of 14 is what we've obtained.

Similarly for the ratings datframe we need to perform the operation. But since there's no duplicate we should find the difference to be 0.

In [120]:
len(ratings_raw)-len(ratings2)

0

### For further analysis let us inspect the ratings dataframe for duplicates.

In [121]:
ratings2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27753444 entries, 0 to 27753443
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 847.0 MB

Now let us search for any duplicate's present in the ratings2 dataframe.

In [122]:
ratings2.duplicated(['userId','movieId']).sum()

21

We identify 21 duplicates present in the dataframe. Let us now explore deeper about the duplicates and see how to handle them.

In [123]:
ratings2[ratings2.duplicated(['userId','movieId'],keep=False)]

          userId  movieId  rating   timestamp
6213836    63786   104155     0.5  1490157153
6214019    63786   104155     0.5  1490157134
6575743    67522     2644     3.0  1522388123
6576057    67522     2644     4.0  1522436661
7128279    73145   104155     4.0  1384276985
7128522    73145   104155     4.0  1421188224
8204118    84432   104155     3.5  1390947133
8204136    84432   104155     3.0  1432918104
10394207  106859    70155     3.0  1500908547
10394847  106859    70155     3.0  1500908560
10397896  106873   104155     4.0  1376975238
10398018  106873   104155     4.5  1436758238
10862664  111688   104155     4.5  1402494730
10862692  111688   104155     4.5  1477450047
12010931  123100    97773     3.0  1450166863
12011347  123100    97773     3.0  1450164192
12243097  125365   111519     4.5  1436452325
12243194  125365   111519     4.5  1427199640
15158896  154880   104155     4.0  1398187007
15158951  154880   104155     3.5  1512964435
15264429  155976    48682     3.5  1267648381
15264776  155976    48682     3.5  1463268492
15653605  159846    66511     2.0  1499318921
15654247  159846    66511     2.0  1534046590
16408991  167835   104155     3.0  1388380607
16409115  167835   104155     3.0  1457545603
17920236  183200   104035     0.5  1475292730
17920390  183200   104035     1.0  1475285150
19174782  195628   104155     3.0  1381140059
19174990  195628   104155     3.0  1530661998
19242274  196323     2644     5.0  1451170687
19243096  196323     2644     5.0  1530938260
21701689  221697   178401     4.0  1527358587
21701699  221697   178401     2.0  1527358755
22505207  230183    97773     3.5  1501655001
22505255  230183    97773     3.5  1464937962
25465019  260133   104155     3.5  1378778895
25465161  260133   104155     2.5  1505977593
26353900  269098   104155     3.5  1377396957
26354146  269098   104155     3.5  1496019855
27242840  278022    46865     3.5  1494713647
27244405  278022    46865     4.0  1494717970

As we inspect the table above, we see that there are duplicate values. But! if you look at it closely, the values in the ratings column for some is different. Thus we cannot conclude with this.

To get a better picture let us now include another subset column, the 'rating' column.

In [124]:
ratings2.duplicated(['userId','movieId','rating']).sum()

13

In [125]:
ratings2[ratings2.duplicated(['userId','movieId','rating'],keep=False)]

          userId  movieId  rating   timestamp
6213836    63786   104155     0.5  1490157153
6214019    63786   104155     0.5  1490157134
7128279    73145   104155     4.0  1384276985
7128522    73145   104155     4.0  1421188224
10394207  106859    70155     3.0  1500908547
10394847  106859    70155     3.0  1500908560
10862664  111688   104155     4.5  1402494730
10862692  111688   104155     4.5  1477450047
12010931  123100    97773     3.0  1450166863
12011347  123100    97773     3.0  1450164192
12243097  125365   111519     4.5  1436452325
12243194  125365   111519     4.5  1427199640
15264429  155976    48682     3.5  1267648381
15264776  155976    48682     3.5  1463268492
15653605  159846    66511     2.0  1499318921
15654247  159846    66511     2.0  1534046590
16408991  167835   104155     3.0  1388380607
16409115  167835   104155     3.0  1457545603
19174782  195628   104155     3.0  1381140059
19174990  195628   104155     3.0  1530661998
19242274  196323     2644     5.0  1451170687
19243096  196323     2644     5.0  1530938260
22505207  230183    97773     3.5  1501655001
22505255  230183    97773     3.5  1464937962
26353900  269098   104155     3.5  1377396957
26354146  269098   104155     3.5  1496019855

Here we encounter some duplicate values. After observing them we can come to a conclusion that these are the duplicate values and perform the necessary operations to get rid of them.

Let us now walk through the process of handling duplicate values by removing them from the dataframe.

In [126]:
dup_ratings = ratings2[ratings2.duplicated(['userId','movieId','rating'],keep=False)]

Let us now identify the unique values of the duplicates by using the unique() function.

In [127]:
dup_ratings.userId.unique()

array([ 63786,  73145, 106859, 111688, 123100, 125365, 155976, 159846,
       167835, 195628, 196323, 230183, 269098], dtype=int64)

Now that we have the unique values, let us have a look at the dataframe with these values.

In [128]:
for m in dup_ratings.userId.unique():
    display(dup_ratings[dup_ratings.userId==m])

         userId  movieId  rating   timestamp
6213836   63786   104155     0.5  1490157153
6214019   63786   104155     0.5  1490157134

         userId  movieId  rating   timestamp
7128279   73145   104155     4.0  1384276985
7128522   73145   104155     4.0  1421188224

          userId  movieId  rating   timestamp
10394207  106859    70155     3.0  1500908547
10394847  106859    70155     3.0  1500908560

          userId  movieId  rating   timestamp
10862664  111688   104155     4.5  1402494730
10862692  111688   104155     4.5  1477450047

          userId  movieId  rating   timestamp
12010931  123100    97773     3.0  1450166863
12011347  123100    97773     3.0  1450164192

          userId  movieId  rating   timestamp
12243097  125365   111519     4.5  1436452325
12243194  125365   111519     4.5  1427199640

          userId  movieId  rating   timestamp
15264429  155976    48682     3.5  1267648381
15264776  155976    48682     3.5  1463268492

          userId  movieId  rating   timestamp
15653605  159846    66511     2.0  1499318921
15654247  159846    66511     2.0  1534046590

          userId  movieId  rating   timestamp
16408991  167835   104155     3.0  1388380607
16409115  167835   104155     3.0  1457545603

          userId  movieId  rating   timestamp
19174782  195628   104155     3.0  1381140059
19174990  195628   104155     3.0  1530661998

          userId  movieId  rating   timestamp
19242274  196323     2644     5.0  1451170687
19243096  196323     2644     5.0  1530938260

          userId  movieId  rating   timestamp
22505207  230183    97773     3.5  1501655001
22505255  230183    97773     3.5  1464937962

          userId  movieId  rating   timestamp
26353900  269098   104155     3.5  1377396957
26354146  269098   104155     3.5  1496019855

Now that we've observed the dataframe with duplicate values, let us write a function to handle them. i.e by removing them from the dataset so that they do not affect the analysis of the dataset.

Let us write a remove_duplicate_from_ratings_dataset function which does the job for us. Notice that we have to remove the duplicates by the index position. If we try to remove them by their column names, we might end up deleting both the values which is a bad practice.

In [129]:
def remove_duplicate_from_ratings_dataset(dataframe: pd.DataFrame, Ids: [int]) -> pd.DataFrame:
    for x in Ids:        
        index_to_remove = dataframe[dataframe.userId == x].index.values.astype(int)[1]
        dataframe = dataframe.drop(index_to_remove)
    return dataframe

ratings_final = remove_duplicate_from_ratings_dataset(ratings2,dup_ratings.userId.unique())

Let us confirm whether the operation is performed by finding the difference between the new dataframe and the previous one. The difference must be 13 as we removed 13 values from the dataframe

In [130]:
len(ratings2) - len(ratings_final)

13

We got the required output to confirm whether the operation is performed.

## We've now removed all the duplicates from both the dataframes: movies and ratings.